files/xml/8.7.0.4/0031__HouseManagmentBinding__importHouseUOData__test_residential2.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns="http://dom.gosuslugi.ru/schema/integration/{{.HuisVer}}/" xmlns:hous="http://dom.gosuslugi.ru/schema/integration/{{.HuisVer}}/house-management/" xmlns:xd="http://www.w3.org/2000/09/xmldsig#">
   <soapenv:Header>
      <ns:RequestHeader>
         <ns:Date>{{CurDateTime1}}</ns:Date>
         <ns:MessageGUID>{{RandomGUID}}</ns:MessageGUID>
         <!-- запрос по УК  {{index .Data "uk"}}  -->
         <ns:SenderID>{{index .Data "SenderID"}}</ns:SenderID>
         <ns:IsOperatorSighnature>true</ns:IsOperatorSighnature>
      </ns:RequestHeader>
   </soapenv:Header>
   <soapenv:Body>
      <hous:importHouseUORequest>
         
         <!--You have a CHOICE of the next 2 items at this level-->
         <hous:ApartmentHouse>
            <hous:ApartmentHouseToUpdate>
               <hous:BasicCharacteristicts>
                  <hous:No_RSO_GKN_EGRP_Registered>true</hous:No_RSO_GKN_EGRP_Registered>
                  <hous:FIASHouseGuid>{{index .Data "FIASHouseGuid_mira1"}}</hous:FIASHouseGuid>
                  <!--Optional:-->
                  <hous:TotalSquare>900</hous:TotalSquare>
                  <!--Optional:-->
                  <hous:State>
                    <ns:Code>2</ns:Code>
                    <ns:GUID>57c4dbc5-bdd5-4490-92e1-3e687797b32a</ns:GUID>
                     <!--Optional:-->
                     <!-- <ns:Name>?</ns:Name> -->
                  </hous:State>
                  <!--Optional:-->
                  <hous:UsedYear>1981</hous:UsedYear>
                  <!--Optional:-->
                  <hous:FloorCount>22</hous:FloorCount>
                  <!--Optional:-->
                  <hous:ResidentialSquare>800</hous:ResidentialSquare>
                  <!--Optional:-->
                  <hous:CulturalHeritage>false</hous:CulturalHeritage>
               </hous:BasicCharacteristicts>
               <!--Optional:-->
               <hous:UndergroundFloorCount>0</hous:UndergroundFloorCount>
               <!--Optional:-->
               <hous:MinFloorCount>22</hous:MinFloorCount>

               <ns:TransportGUID>{{RandomGUID}}</ns:TransportGUID>
            </hous:ApartmentHouseToUpdate>

            <hous:EntranceToUpdate>
               <hous:EntranceNum>2</hous:EntranceNum>
               <hous:StoreysCount>10</hous:StoreysCount>
               <hous:CreationDate>2016-04-01</hous:CreationDate>
               <ns:TransportGUID>{{RandomGUID}}</ns:TransportGUID>
               <hous:EntranceGUID>2e3a7859-3567-41e4-a5a6-857630568865</hous:EntranceGUID>
            </hous:EntranceToUpdate>  

            <hous:ResidentialPremises>


               <hous:ResidentialPremisesToCreate>
<hous:No_RSO_GKN_EGRP_Registered>true</hous:No_RSO_GKN_EGRP_Registered>
                  <hous:PremisesNum>11</hous:PremisesNum>
                  <hous:EntranceNum>2</hous:EntranceNum>
                  <hous:PremisesCharacteristic>
                    <ns:Code>1</ns:Code>
                    <ns:GUID>96a1ce61-b402-46c4-ac6e-34b8670480af</ns:GUID>
                  </hous:PremisesCharacteristic>
                  <hous:TotalArea>20</hous:TotalArea>
                  <hous:GrossArea>15</hous:GrossArea>
                  <ns:TransportGUID>{{RandomGUID}}</ns:TransportGUID>
               </hous:ResidentialPremisesToCreate>
            </hous:ResidentialPremises>

         </hous:ApartmentHouse>
      </hous:importHouseUORequest>
   </soapenv:Body>
</soapenv:Envelope>